package com.example.melnyk_sportea_app.json

object MockJson {
    const val json = "[\n" +
            "  {\n" +
            "    \"exercises\": [\n" +
            "      {\n" +
            "        \"dayNum\": 1,\n" +
            "        \"description\": \"Упражнение для разминки и подготовки грудных мышц к тренировке. Варьируйте различные типы и ширину постановки рук, а также используйте подставку под ноги для усложнения. 2-3 подхода по 12-15 повторений\",\n" +
            "        \"difficulty\": \"EASY\",\n" +
            "        \"id\": 0,\n" +
            "        \"imageUrl\": \"https://fitseven.ru/wp-content/uploads/2019/09/otjimaniya-1.jpg\",\n" +
            "        \"kcal\": 100,\n" +
            "        \"muscleGroup\": \"ARMS\",\n" +
            "        \"name\": \"Отжимания от пола\",\n" +
            "        \"repeats\": 10,\n" +
            "        \"restTime\": 10,\n" +
            "        \"sets\": 3,\n" +
            "        \"weight\": 0.0,\n" +
            "        \"workTime\": 30\n" +
            "      },\n" +
            "      {\n" +
            "        \"dayNum\": 1,\n" +
            "        \"description\": \"Упражнение выполняется со средним рабочим весом, контролем за техникой и полным ощущением вовлечения грудных мышц в работу. Старайтесь как можно сильнее напрячь и свести грудь внутрь, выставляя руки вперед — но не фиксируя при этом локти. 2-3 подхода по 12-15 повторений\",\n" +
            "        \"difficulty\": \"EASY\",\n" +
            "        \"id\": 1,\n" +
            "        \"imageUrl\": \"https://fitseven.ru/wp-content/uploads/2019/09/svedeniya-na-grud.jpg\",\n" +
            "        \"kcal\": 70,\n" +
            "        \"muscleGroup\": \"CHEST\",\n" +
            "        \"name\": \"Сведения на грудь\",\n" +
            "        \"repeats\": 10,\n" +
            "        \"restTime\": 10,\n" +
            "        \"sets\": 15,\n" +
            "        \"weight\": 2.0,\n" +
            "        \"workTime\": 15\n" +
            "      }\n" +
            "    ],\n" +
            "    \"id\": 0,\n" +
            "    \"programName\": \"Тренировки для новичков\"\n" +
            "  },\n" +
            "  {\n" +
            "    \"exercises\": [\n" +
            "      {\n" +
            "        \"dayNum\": 1,\n" +
            "        \"description\": \"Упражнение для разминки и подготовки грудных мышц к тренировке. Варьируйте различные типы и ширину постановки рук, а также используйте подставку под ноги для усложнения. 2-3 подхода по 12-15 повторений\",\n" +
            "        \"difficulty\": \"HARD\",\n" +
            "        \"id\": 0,\n" +
            "        \"imageUrl\": \"https://fitseven.ru/wp-content/uploads/2019/09/otjimaniya-1.jpg\",\n" +
            "        \"kcal\": 210,\n" +
            "        \"muscleGroup\": \"CHEST\",\n" +
            "        \"name\": \"Жим штанги лежа\",\n" +
            "        \"repeats\": 10,\n" +
            "        \"restTime\": 20,\n" +
            "        \"sets\": 4,\n" +
            "        \"weight\": 20.5,\n" +
            "        \"workTime\": 60\n" +
            "      },\n" +
            "      {\n" +
            "        \"dayNum\": 1,\n" +
            "        \"description\": \"Ключевое упражнение для развития мышц бицепса. При выполнении используйте средний вес, позволяющий выполнить до 15 повторов. Не раскачивайтесь при подъеме штанги и держите локти в одной и той же точке. 2-3 подхода по 12-15 повторений.\",\n" +
            "        \"difficulty\": \"MEDIUM\",\n" +
            "        \"id\": 1,\n" +
            "        \"imageUrl\": \"https://fitseven.ru/wp-content/uploads/2019/09/shtanga-na-biceps-900x600.jpg\",\n" +
            "        \"kcal\": 15,\n" +
            "        \"muscleGroup\": \"ARMS\",\n" +
            "        \"name\": \"Подъемы штанги на бицепс\",\n" +
            "        \"repeats\": 20,\n" +
            "        \"restTime\": 15,\n" +
            "        \"sets\": 4,\n" +
            "        \"weight\": 13.0,\n" +
            "        \"workTime\": 60\n" +
            "      }\n" +
            "    ],\n" +
            "    \"id\": 0,\n" +
            "    \"programName\": \"Тренировки для продвинутых\"\n" +
            "  }\n" +
            "]"
}